org/posts.org
#+TITLE:    Google Classroom
#+AUTHOR:   G. Srinivasachar
#+EMAIL:
#+DATE:     13 Dec 2017
#+HTML_HEAD: <style type="text/css">body{ max-width:50%; margin:auto;}</style>
#+OPTIONS: html-postamble:nil toc:t num:nil whn:t
#+INFOJS_OPT: view:overview toc:nil mouse:#dddddd
#+HTML_LINK_HOME: https://atrians.github.io/cse/
#+EXPORT_FILE_NAME: 2017-12-12-classroom
-----
* Classroom
  :PROPERTIES:
  :title: ":ramen: Classroom"
  :layout: post
  :date: 2017-12-12 20:00
  :tag: jekyll
  :image: https://atrians.github.io/cse/assets/images/profile.jpg
  :headerImage: true
  :projects: true
  :hidden: true # don't count this post in blog pagination
  :description: "TL project."
  :category: project
  :author: Srinivasachar, G
  :externalLink: true
  :externalLink: https://atrians.github.io/cse/html/2017-12-12-classroom.html
  :END:
** Introduction

   * https://classroom.google.com/
   * Paperless classes conducted using G suite (drive, forms, docs,  etc).
   * Students and Teachers must belong to the same domain www.atria.edu.
   * Teacher creates class and invite students using class code
   * Classroom folder automatically created in teacher & student drives.
   * Teacher can differentiate class of students while assigning work
   * Teacher gets the student summary as progress
   * Student gets to know the teachers feedback
   * Unlimited drive space

** Features

   + Automation of manual tasks
   + Collaboration between stake holders
   + Security hierarchy
   + Suitable reports
   + Scalable
   + Future proof

** Forms

   + Subject allotment
   + Students List
   + Attendance form
   + Internals form
   + Student registration
   + Feedback
   + Results

** Reports

   Attendance compliance between,

   + Department
   + Sections
   + Subjects

   Attendance summary for,

   + Department
   + Student

   Similar reports regarding internals.

** Conclusions

   I have experimented with the forms and classroom prototype. The
   details are:

   + Repository of forms
   + Class room for one course
   + Attendance for one subject
   + My experience has been good.

   Action Items

   1) Train the class coordinators and who in turn will train the
      department staff for adopting the google classroom.

   2) Management takes a decision to create email accounts for
      students under www.atria.edu domain.

 -----
