_posts/2017-12-12-classroom.markdown
---
title: ":ramen: Classroom"
layout: post
date: 2017-12-12 20:00
tag: jekyll
image: https://atrians.github.io/cse/assets/images/profile.jpg
headerImage: true
projects: true
hidden: true # don't count this post in blog pagination
description: "TL project."
category: project
author: Srinivasachar, G
externalLink: false
---

<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://atrians.github.io/cse/"> HOME </a>
</div><div id="content">
<h1 class="title">Google Classroom</h1>
<div id="outline-container-org9030331" class="outline-2">
<h2 id="org9030331">Introduction</h2>
<div class="outline-text-2" id="text-org9030331">
<ul class="org-ul">
<li><a href="https://classroom.google.com/">https://classroom.google.com/</a></li>
<li>Paperless classes conducted using G suite (drive, forms, docs,  etc).</li>
<li>Students and Teachers must belong to the same domain www.atria.edu.</li>
<li>Teacher creates class and invite students using class code</li>
<li>Classroom folder automatically created in teacher &amp; student drives.</li>
<li>Teacher can differentiate class of students while assigning work</li>
<li>Teacher gets the student summary as progress</li>
<li>Student gets to know the teachers feedback</li>
<li>Unlimited drive space</li>
</ul>
</div>
</div>

<div id="outline-container-org8d8970e" class="outline-2">
<h2 id="org8d8970e">Features</h2>
<div class="outline-text-2" id="text-org8d8970e">
<ul class="org-ul">
<li>Automation of manual tasks</li>
<li>Collaboration between stake holders</li>
<li>Security hierarchy</li>
<li>Suitable reports</li>
<li>Scalable</li>
<li>Future proof</li>
</ul>
</div>
</div>

<div id="outline-container-org663de65" class="outline-2">
<h2 id="org663de65">Forms</h2>
<div class="outline-text-2" id="text-org663de65">
<ul class="org-ul">
<li>Subject allotment</li>
<li>Students List</li>
<li>Attendance form</li>
<li>Internals form</li>
<li>Student registration</li>
<li>Feedback</li>
<li>Results</li>
</ul>
</div>
</div>

<div id="outline-container-org583ce54" class="outline-2">
<h2 id="org583ce54">Reports</h2>
<div class="outline-text-2" id="text-org583ce54">
<p>
Attendance compliance between,
</p>

<ul class="org-ul">
<li>Department</li>
<li>Sections</li>
<li>Subjects</li>
</ul>

<p>
Attendance summary for,
</p>

<ul class="org-ul">
<li>Department</li>
<li>Student</li>
</ul>

<p>
Similar reports regarding internals.
</p>
</div>
</div>

<div id="outline-container-org71e3a96" class="outline-2">
<h2 id="org71e3a96">Conclusions</h2>
<div class="outline-text-2" id="text-org71e3a96">
<p>
I have experimented with the forms and classroom prototype. The
details are:
</p>

<ul class="org-ul">
<li>Repository of forms</li>
<li>Class room for one course</li>
<li>Attendance for one subject</li>
<li>My experience has been good.</li>
</ul>

<p>
Action Items
</p>

<ol class="org-ol">
<li>Train the class coordinators and who in turn will train the
department staff for adopting the google classroom.</li>

<li>Management takes a decision to create email accounts for
students under www.atria.edu domain.</li>
</ol>

<hr />
</div>
</div>
</div>
</body>
